In [ ]:
''' 
 1) 열의 개수와 행의 개수가 각각 5개 이상이고, 데이터는 10에서 99까지 임의의
     정수인 데이터프레임을 만드세요.
  2) 열의 이름은 V, W, X, Y, Z 이고 행의 이름은 a, b, c, d, e 으로 만든다.
  3) 정 가운데에 있는 데이터를 인덱싱하려고 한다. 
     10개 이상의 방법으로 인덱싱하세요.
'''

In [ ]:
#  1) 열의 개수와 행의 개수가 각각 5개 이상이고, 데이터는 10에서 99까지 임의의
#      정수인 데이터프레임을 만드세요.
'''
python = random.randint(이상,이하)
numpy = np.random.randint(이상,초과)
'''

In [ ]:
#  2) 열의 이름은 V, W, X, Y, Z 이고 행의 이름은 a, b, c, d, e 으로 만든다.

In [ ]:
#   3) 정 가운데에 있는 데이터를 인덱싱하려고 한다. 
#      10개 이상의 방법으로 인덱싱하세요.

In [ ]:
'''
  1) 법정동코드 전체자료.txt를 파일로부터 읽어서 데이터프레임으로 만드세요.
  2) 현재 존재하는 경기도 수원시 데이터만 추출하세요.
  3) 수원시 장안구에 있는 동의 이름을 추출하세요.
'''

In [2]:
import numpy as np
import pandas as pd

In [3]:
#   1) 법정동코드 전체자료.txt를 파일로부터 읽어서 데이터프레임으로 만드세요.
pe = pd.read_csv('data/법정동코드 전체자료.txt', encoding='euc-kr', sep='\t')
pe

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46323  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46324  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46325  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46326  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46327  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[46328 rows x 3 columns]

In [3]:
pe.isna().sum()

법정동코드    0
법정동명     0
폐지여부     0
dtype: int64

In [4]:
pe.폐지여부.value_counts()

폐지여부
폐지    25777
존재    20551
Name: count, dtype: int64

In [4]:
pe = pe[pe.폐지여부 == '존재']
pe

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46323  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46324  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46325  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46326  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46327  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[20551 rows x 3 columns]

In [5]:
#   2) 현재 존재하는 경기도 수원시 데이터만 추출하세요.
pe = pe[pe['법정동명'].str.contains('경기도 수원시')]
pe

           법정동코드             법정동명 폐지여부
4819  4111000000          경기도 수원시   존재
4884  4111100000      경기도 수원시 장안구   존재
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재
4915  4111113100  경기도 수원시 장안구 이목동   존재
...          ...              ...  ...
5023  4111710300  경기도 수원시 영통구 이의동   존재
5024  4111710400   경기도 수원시 영통구 하동   존재
5025  4111710500  경기도 수원시 영통구 영통동   존재
5026  4111710600   경기도 수원시 영통구 신동   존재
5027  4111710700  경기도 수원시 영통구 망포동   존재

[61 rows x 3 columns]

In [66]:
#   3) 수원시 장안구에 있는 동의 이름을 추출하세요.
p2 = pe[pe['법정동명'].str.contains('경기도 수원시 장안구')]

In [67]:
p2

           법정동코드              법정동명 폐지여부
4913  4111112900   경기도 수원시 장안구 파장동   존재
4914  4111113000   경기도 수원시 장안구 정자동   존재
4915  4111113100   경기도 수원시 장안구 이목동   존재
4916  4111113200   경기도 수원시 장안구 율전동   존재
4917  4111113300   경기도 수원시 장안구 천천동   존재
4918  4111113400   경기도 수원시 장안구 영화동   존재
4919  4111113500   경기도 수원시 장안구 송죽동   존재
4920  4111113600   경기도 수원시 장안구 조원동   존재
4921  4111113700   경기도 수원시 장안구 연무동   존재
4922  4111113800  경기도 수원시 장안구 상광교동   존재
4923  4111113900  경기도 수원시 장안구 하광교동   존재

In [60]:
p2 = p2.drop(p2[p2['법정동명'] == '경기도 수원시 장안구'].index)

In [74]:
p2.iloc[:,1:2]

                  법정동명
4913   경기도 수원시 장안구 파장동
4914   경기도 수원시 장안구 정자동
4915   경기도 수원시 장안구 이목동
4916   경기도 수원시 장안구 율전동
4917   경기도 수원시 장안구 천천동
4918   경기도 수원시 장안구 영화동
4919   경기도 수원시 장안구 송죽동
4920   경기도 수원시 장안구 조원동
4921   경기도 수원시 장안구 연무동
4922  경기도 수원시 장안구 상광교동
4923  경기도 수원시 장안구 하광교동

In [112]:
p2.iloc[:,1:2],str.split(' ')

(                  법정동명
 4913   경기도 수원시 장안구 파장동
 4914   경기도 수원시 장안구 정자동
 4915   경기도 수원시 장안구 이목동
 4916   경기도 수원시 장안구 율전동
 4917   경기도 수원시 장안구 천천동
 4918   경기도 수원시 장안구 영화동
 4919   경기도 수원시 장안구 송죽동
 4920   경기도 수원시 장안구 조원동
 4921   경기도 수원시 장안구 연무동
 4922  경기도 수원시 장안구 상광교동
 4923  경기도 수원시 장안구 하광교동,
 [])

In [ ]:
p2.법정동명,str.split()

In [83]:
p2.법정동명

4913     경기도 수원시 장안구 파장동
4914     경기도 수원시 장안구 정자동
4915     경기도 수원시 장안구 이목동
4916     경기도 수원시 장안구 율전동
4917     경기도 수원시 장안구 천천동
4918     경기도 수원시 장안구 영화동
4919     경기도 수원시 장안구 송죽동
4920     경기도 수원시 장안구 조원동
4921     경기도 수원시 장안구 연무동
4922    경기도 수원시 장안구 상광교동
4923    경기도 수원시 장안구 하광교동
Name: 법정동명, dtype: object

In [113]:
p2.법정동명,str.split(' ')

(4913     경기도 수원시 장안구 파장동
 4914     경기도 수원시 장안구 정자동
 4915     경기도 수원시 장안구 이목동
 4916     경기도 수원시 장안구 율전동
 4917     경기도 수원시 장안구 천천동
 4918     경기도 수원시 장안구 영화동
 4919     경기도 수원시 장안구 송죽동
 4920     경기도 수원시 장안구 조원동
 4921     경기도 수원시 장안구 연무동
 4922    경기도 수원시 장안구 상광교동
 4923    경기도 수원시 장안구 하광교동
 Name: 법정동명, dtype: object,
 [])

In [110]:
p2.법정동명.str.find('동')# 스트링 -1은 없다는것 6번째부터 (index번호) 종로구이라는 단어가 있다는 의미
# 0보다크면 내가 찾는글자가 있다 /0보자 작은 -1 이 나오면 없다

4913    14
4914    14
4915    14
4916    14
4917    14
4918    14
4919    14
4920    14
4921    14
4922    15
4923    15
Name: 법정동명, dtype: int64

In [124]:
p2['법정동명'].str[11:]

4913      파장동
4914      정자동
4915      이목동
4916      율전동
4917      천천동
4918      영화동
4919      송죽동
4920      조원동
4921      연무동
4922     상광교동
4923     하광교동
Name: 법정동명, dtype: object

In [116]:
p3 = p2['법정동명'].str.split(' ')
p3

4913     [경기도, 수원시, 장안구, 파장동]
4914     [경기도, 수원시, 장안구, 정자동]
4915     [경기도, 수원시, 장안구, 이목동]
4916     [경기도, 수원시, 장안구, 율전동]
4917     [경기도, 수원시, 장안구, 천천동]
4918     [경기도, 수원시, 장안구, 영화동]
4919     [경기도, 수원시, 장안구, 송죽동]
4920     [경기도, 수원시, 장안구, 조원동]
4921     [경기도, 수원시, 장안구, 연무동]
4922    [경기도, 수원시, 장안구, 상광교동]
4923    [경기도, 수원시, 장안구, 하광교동]
Name: 법정동명, dtype: object

In [121]:
p3 = p2['법정동명'].str.split(' ',expand=True)

In [123]:
p3[3]

4913     파장동
4914     정자동
4915     이목동
4916     율전동
4917     천천동
4918     영화동
4919     송죽동
4920     조원동
4921     연무동
4922    상광교동
4923    하광교동
Name: 3, dtype: object

In [7]:
dong_list = []
pe = pe[pe.법정동명.str.contains('장안구') & pe.법정동명.str.contains('동')]
pe.head()

           법정동코드             법정동명 폐지여부
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재
4915  4111113100  경기도 수원시 장안구 이목동   존재
4916  4111113200  경기도 수원시 장안구 율전동   존재
4917  4111113300  경기도 수원시 장안구 천천동   존재

In [8]:
dong_list = []
for line in pe.법정동명:
    dong = line.split()[-1].strip()
    dong_list.append(dong)
dong_list

['파장동', '정자동', '이목동', '율전동', '천천동', '영화동', '송죽동', '조원동', '연무동', '상광교동', '하광교동']

In [ ]:
'''
Titanic 데이터를 로드한 후 다음에 답하세요.
  1) 결측치를 찾아서 결측치를 제거 또는 대체하고, 그 이유를 간단히 적으세요.
  2) 나이의 결측치를 중앙값으로 대체한 후 qcut을 이용하여 나이에 따라 
     3개의 그룹으로 나누세요.
  3) 성별과 embark_town에 따른 생존율을 구하세요.
  4) 타이타닉 탑승객의 성별에 따른 평균 나이를 구하세요.
'''

In [10]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [8]:
#   1) 결측치를 찾아서 결측치를 제거 또는 대체하고, 그 이유를 간단히 적으세요.
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
# deck는 결측치가 너무 많아서 컬럼 삭제 할것
titanic.drop(columns=['deck'],inplace=True)

In [ ]:
df.drop(columns=['deck'],inplace=True) # 결측치가 너무 많아 열 삭제
dt.embarked.fillna('S', inplace=True) # 결측치가 별로 없어서 최빈값으로 대체
dt.embarked_town.fillna('Southampton',inplace=True) # 상동
dt.age.fillna(dt.age.median().round(1),inplace=True) # 중앙값으로 대체
dt.isna().sum().sum()

In [12]:
# embarked 결측치는 최빈값으로 대체 embarked는 카테고리형 가장 많이 나오는 유형
titanic.embarked.value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [13]:
titanic.embarked.fillna('S', inplace=True)
titanic.embarked.value_counts()

embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [14]:
# embarked_town 결측치는 행 삭제
titanic.dropna(subset=['embark_town'], inplace=True) # embark_town에 NaN이 있는 행을 날려라
titanic.isna().sum().sum() # titanic안에 더이상 결측치가 나마있찌 않음

177

In [15]:
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

In [ ]:
#   2) 나이의 결측치를 중앙값으로 대체한 후 qcut을 이용하여 나이에 따라 
#      3개의 그룹으로 나누세요.

In [16]:
# age 결측치는 평균으로 대체
titanic.age.fillna(titanic.age.mean().round(2), inplace=True) # age column을 fillna  NaN을 평균으로

In [17]:
# qcut 명령으로 세 개의 나이 그룹을 만든다.
titanic['cat'] = pd.qcut(titanic.age, 3, labels=['A1','A2','A3'])
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone,cat
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False,A1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False,A3
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True,A2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False,A3
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True,A3

In [18]:
#   3) 성별과 embark_town에 따른 생존율을 구하세요.
titanic.pivot_table('survived',['sex', 'embark_town'], aggfunc='mean')

                    survived
sex    embark_town
female Cherbourg    0.876712
       Queenstown   0.750000
       Southampton  0.689655
male   Cherbourg    0.305263
       Queenstown   0.073171
       Southampton  0.174603

In [19]:
# 정답
titanic.pivot_table('survived','sex', 'embark_town', aggfunc='mean')

embark_town  Cherbourg  Queenstown  Southampton
sex
female        0.876712    0.750000     0.689655
male          0.305263    0.073171     0.174603

In [16]:
# 4) 타이타닉 탑승객의 성별에 따른 평균 나이를 구하세요. /난독이네..
titanic.pivot_table('age',['survived', 'sex'], aggfunc='mean')

                       age
survived sex
0        female  26.010864
         male    31.161581
1        female  28.788052
         male    27.623028

In [21]:
# 정답
titanic.pivot_table('age', 'sex', aggfunc='mean')

              age
sex
female  28.067051
male    30.493120